---
kind: type
id: T:Autodesk.Revit.DB.InternalDefinitions
source: html/a31f60e4-c68a-d98f-4a88-82acad8b568f.htm
---
# Autodesk.Revit.DB.InternalDefinitions

This object blocks attempts to create new internal definitions as they are not permitted.

## Syntax (C#)
```csharp
public class InternalDefinitions : Definitions
```